
roots = (
    "ним", "вод", "глад", "клад", "корм",
    "лаг", "ладн", "лож", "лаж", "люб",
    "спор", "лаз", "мож", "зор", "мир",
    "мер", "бер", "бир", "пер", "пир",
    "тер", "тир", "рост", "ращ", "зар",
    "рос", "плов", "плав", "кос", "кас",
)

prefixes = (
    "без", "бес", "в", "вз", "вне",
    "воз", "вос", "вы", "до", "из",
    "изо", "ко", "меж", "на", "над",
    "наи", "не", "недо", "ни", "низ",
    "нис", "о", "около", "от", "пере",
    "по", "под", "после", "пра", "пре",
    "пред", "при", "про", "раз", "роз",
    "рос", "с", "сверх", "со", "су",
    "у", "черес",
)

suffixes_verb = (
    "ирова", "ича", "ва", "ева", "ива",
    "ка", "ну", "ова", "ыва", "ир",
)

suffixes_adj = (
    "менн", "овит", "оват", "ческ", "янн",
    "абельн", "ав", "айш", "альн", "арн",
    "аст", "яст", "ашн", "вш", "ев",
    "ейш", "ем", "ен", "енн", "еск",
    "ив", "ивн", "им", "ительн", "ич",
    "ическ", "ичн", "ишн", "лив", "нн",
    "озн", "ом", "очн", "ск", "тельн",
    "чив", "яв", "ан", "еньк", "ин",
    "ист", "ит",
)

suffixes_noun = (
    "аг", "ак", "ац", "ек", "енк",
    "ион", "овик", "тор", "чиц", "явк",
    "яр", "яшк", "аж", "ант", "ар",
    "ач", "ень", "енок", "ент", "ер",
    "еств", "ец", "еч", "ечк", "изм",
    "ик", "илк", "инк", "иц", "ичк",
    "ишк", "ник", "ниц", "няк", "оз",
    "ок", "он", "онк", "онок", "ор",
    "ость", "от", "очк", "ств", "тель",
    "чик", "щик", "щиц", "ыш", "юшк",
    "янт", "як", "ир", "ан", "еньк",
    "ин", "ист", "ит",
)

flexion_verb = ["ть", "ться", "чь", "чься"]

flexion_adj = ["ый", "ий", "ая", "ое"]

flexion_noun = ["", "а", "о", "е", "и", "ы", "я"]
